import React from 'react';

const DATA = [
    {
        title: "про бюро", 
        text: <div><p>Державне підприємство «Українське бюро лінгвістичних експертиз НАН України» створене відповідно до постанови Бюро Президії НАН України № 340 від 29 грудня 2004 р. Його діяльність скерована на розв'язання спірних питань, що виникають у сфері офіційно-ділового функціонування української мови, а також інших мов у правовому полі України.</p> <p>Бюро співпрацює з Українською національною комісією з питань правопису, науковими установами НАН України та інших відомств, Міністерством освіти і науки України, Міністерством юстиції України, іншими державними органами.</p> <p>Бюро підтримує зв'язки і консультується з закордонними установами та фахівцями.</p> <p>Директор: доктор філологічних наук Богдан Миколайович Ажнюк</p> <p>Довідки телефонами:</p> <p>(044) 279-02-27; (044) 587-80-98;</p> <p>(095) 852-08-08; (097) 551-57-78.</p></div>
    },
    {
        title:
    }
]


function App() {
    return (
        <div>
            <h1>{DATA[0].title}</h1>
            {DATA[0].text}
        </div>
    );  
}

export default App;
