import React from 'react';

const DATA = [
    {
        title: "про бюро", 
        text: <div><p>Державне підприємство «Українське бюро лінгвістичних експертиз НАН України» створене відповідно до постанови Бюро Президії НАН України № 340 від 29 грудня 2004 р. Його діяльність скерована на розв'язання спірних питань, що виникають у сфері офіційно-ділового функціонування української мови, а також інших мов у правовому полі України.</p> <p>Бюро співпрацює з Українською національною комісією з питань правопису, науковими установами НАН України та інших відомств, Міністерством освіти і науки України, Міністерством юстиції України, іншими державними органами.</p> <p>Бюро підтримує зв'язки і консультується з закордонними установами та фахівцями.</p> <p>Директор: доктор філологічних наук Богдан Миколайович Ажнюк</p> <p>Довідки телефонами:</p> <p>(044) 279-02-27; (044) 587-80-98;</p> <p>(095) 852-08-08; (097) 551-57-78.</p></div>
    },
    {
        title: "імена та прізвища",
        text: <div><p><strong>Про встановлення ідентичності записів прізвищ, імен та інших власних назв</strong></p> <p>У різних документах однієї особи або в документах родичів, трапляються записи прізвищ, імен та інших власних назв, які відрізняються своїм написанням. Встановлення ідентичності таких записів віднесено до компетенції Українського бюро лінгвістичних експертиз НАН України (див. інформаційні матеріали).</p> <p>Надання експертних висновків щодо ідентичності записів прізвищ, імен та інших власних назв здійснюється на підставі аналізу документів (надаються в копіях), що містять ці записи.</p> <p>Для отримання експертного висновку потрібно дізнатися телефоном, чи у Вашому випадку можливий позитивний результат і якою буде вартість експертного висновку (тариф залежить від ступеня складності). Інформацію про принципову можливість позитивного висновку, його вартість та термін підготовки надаємо телефонами (044) 279-02-27, (044) 587-80-98, 095-852-08-08, 097-551-57-78.</p> <p>Експертний висновок можна отримати:</p> <ul><li>особисто (години прийому з 10 до 17 год., перерва з 13 до 14 год., вихідні: субота, неділя)</li> <li>Укрпоштою: надіслати на адресу Бюро заповнену заяву за зразком поданим нижче, копію квитанції про оплату, копії документів із записами імені або прізвища, що відрізняються між собою.</li></ul> <p>Для термінових замовлень існує режим «експрес» (інформацію надаємо телефонами 095-852-08-08, 097-551-57-78)</p></div>
    },
    {
        title: "sddsd",
        text: "dsdsd"
    }
]


class App extends React.Component {
    constructor() {
        super();
        this.state = {
            number: 1
        }
    }

    render() {
        return (
        <React.Fragment>
            <h1>Українське бюро лінгвістичних експертиз</h1>
            <div>{DATA.map((qw, index) => <button key={index} onClick={() => this.setState({number: index})}>{qw.title}</button>)}</div>
            <div className="main-div">
                <h1>{DATA[this.state.number].title}</h1>
                {DATA[this.state.number].text}
            </div>
        </React.Fragment>
    );  
    }
}

export default App;
