import React from 'react';

const DATA = [
    {
        title: "про бюро", 
        text: <div><p>Державне підприємство «Українське бюро лінгвістичних експертиз НАН України» створене відповідно до постанови Бюро Президії НАН України № 340 від 29 грудня 2004 р. Його діяльність скерована на розв'язання спірних питань, що виникають у сфері офіційно-ділового функціонування української мови, а також інших мов у правовому полі України.</p> <p>Бюро співпрацює з Українською національною комісією з питань правопису, науковими установами НАН України та інших відомств, Міністерством освіти і науки України, Міністерством юстиції України, іншими державними органами.</p> <p>Бюро підтримує зв'язки і консультується з закордонними установами та фахівцями.</p> <p>Директор: доктор філологічних наук Богдан Миколайович Ажнюк</p> <p>Довідки телефонами:</p> <p>(044) 279-02-27; (044) 587-80-98;</p> <p>(095) 852-08-08; (097) 551-57-78.</p></div>
    },
    {
        title: "імена та прізвища",
        text: <div><p><strong>Про встановлення ідентичності записів прізвищ, імен та інших власних назв</strong></p> <p>У різних документах однієї особи або в документах родичів, трапляються записи прізвищ, імен та інших власних назв, які відрізняються своїм написанням. Встановлення ідентичності таких записів віднесено до компетенції Українського бюро лінгвістичних експертиз НАН України (див. інформаційні матеріали).</p> <p>Надання експертних висновків щодо ідентичності записів прізвищ, імен та інших власних назв здійснюється на підставі аналізу документів (надаються в копіях), що містять ці записи.</p> <p>Для отримання експертного висновку потрібно дізнатися телефоном, чи у Вашому випадку можливий позитивний результат і якою буде вартість експертного висновку (тариф залежить від ступеня складності). Інформацію про принципову можливість позитивного висновку, його вартість та термін підготовки надаємо телефонами (044) 279-02-27, (044) 587-80-98, 095-852-08-08, 097-551-57-78.</p> <p>Експертний висновок можна отримати:</p> <ul><li>особисто (години прийому з 10 до 17 год., перерва з 13 до 14 год., вихідні: субота, неділя)</li> <li>Укрпоштою: надіслати на адресу Бюро заповнену заяву за зразком поданим нижче, копію квитанції про оплату, копії документів із записами імені або прізвища, що відрізняються між собою.</li></ul> <p>Для термінових замовлень існує режим «експрес» (інформацію надаємо телефонами 095-852-08-08, 097-551-57-78)</p></div>
    },
    {
        title: "послуги",
        text: <div><p>Українське бюро лінгвістичних експертиз Національної академії наук України надає такі послуги:</p> <ul><li>Лінгвістична експертиза, пов'язана зі спірним тлумаченням нормативних та ділових документів (постанов, договорів, контрактів і т. ін.)</li> <li>Лінгвістична експертиза текстів у справах про захист честі, гідності та ділової репутації громадян та юридичних осіб</li> <li>Установлення ідентичності прізвищ, імен та інших власних назв, що відрізняються орфографічними, граматичними або структурними особливостями</li> <li>Установлення ідентичності прізвищ, імен та інших власних назв, записаних різними мовами</li> <li>Аналіз якості перекладу, встановлення відповідності перекладного тексту (елементів тексту) оригіналові</li> <li>Експертиза текстів та елементів тексту щодо їх відповідності нормам правопису, правилам міжмовної транслітерації, законодавству України про мову</li> <li>Лінгвістична експертиза, пов'язана з правовим захистом інтелектуальної власності та авторського права</li> <li>Лінгвістична експертиза, пов'язана з правовим захистом товарного знака і т. ін.</li> <li>Інші види лінгвістичних експертиз</li> <li>Консультативні послуги.</li></ul> <strong><p>Умови надання послуг</p></strong> <p>Замовник надає в розпорядження Бюро матеріал, достатній для повноцінного експертного дослідження.</p> <strong><p>Оплата</p></strong> <p>Оплата за експертні послуги визначається індивідуально в кожному випадку і залежить від:</p> <ol type="1"><li>обсягу й характеру наданого для експертизи матеріалу</li> <li>ступеня складності експертних завдань</li> <li>кількості експертів (комісійна експертиза)</li> <li>додаткових видатків</li></ol> <p>Довідки телефонами: <br/>(044) 279-02-27,<br/>(095) 852-08-08, (097) 551-57-78.</p> <p>Viber:<br/>(097) 551-57-78.</p> <strong><p>Реквізити</p></strong> <p>Отримувач: Українське бюро лінгвістичних експертиз НАН України<br/>Рахунок UA13 3209 8400 0002 6007 2103 2328 8<br/>АТ «ПроКредит Банк» м. Київ <br/>МФО 320984<br/> Код отримувача 33494653</p></div>
    },
    {
    	title: "публікації",
    	text: <div><ul><li>Леся Ажнюк. Лінгвістична експертиза як юридичний інструмент // Магістеріум. Мовознавчі студії. - 2017. - Вип. 66. - С. 8-15.</li> <li>Богдан Ажнюк. Проверить на слово // Юридическая практика № 50, 2014, с. 14.</li> <li>Інформаційний лист Державної реєстраційної служби України від 15.09.2014 № 2265/8 -14-06</li> <li>Інформаційний лист Державної міграційної служби України № 5.4/5961-14 від 15.08.2014</li> <li>Інформаційний лист Департаменту нотаріату та реєстрації адвокатських об'єднань Міністерства юстиції України № 13145-0-33-08-31 від 20.11.2008</li> <li>Ще пункт</li> <li>Ще пункт</li> <li>Ще пункт</li> <li>Ще пункт</li> <li>Ще пункт</li> <li>Ще пункт</li> <li>Ще пункт</li></ul></div>
    },
    {
    	title: "законодавча база",
    	text: <div><p>Державне підприємство «Українське бюро лінгвістичних експертиз НАН України» є суб'єктом науково-дослідної, експертної, та видавничої діяльності і діє відповідно до Конституції України, Закону України “Про наукову і науково-технічну діяльність” та Закону України “Про наукову і науково-технічну експертизу”.</p> <p>Витяги з закону України <br/>Про наукову і науково-технічну експертизу<br/> (із змінами і доповненнями, внесеними Законом України від 21 вересня 1999 року N 1069-XIV)</p> <strong><p>Стаття 4.</p></strong> <p>Замовниками наукової і науково-технічної експертизи можуть бути органи державної влади і органи місцевого самоврядування, підприємства, установи і організації, громадяни, заінтересовані у проведенні такої експертизи.</p><p>Замовники наукової і науково-технічної експертизи формують завдання на проведення експертизи, забезпечують оплату витрат на її проведення, оплату праці експертів або послуг організаторів експертизи.</p> <strong><p>Стаття 31.</p></strong> <p>«Наукові організації академій наук України, заснованих на державній власності, ... можуть здійснювати спеціалізовану експертну діяльність без додаткової державної акредитації, на підставі статутних положень, якими така діяльність передбачається»</p></div>
    },
    {
    	title: "контакти",
    	text: <div><p>Адреса: 01601, Київ, вул. Грушевського, 4, к. 603</p> <p>e-mail: expert@lingvoexpert.org.ua</p> <p>Довідки телефонами: <br/>(044) 279-02-27,<br/>(095) 852-08-08, (097) 551-57-78.</p> <p>Viber:<br/>(097) 551-57-78.</p> <strong><p>Реквізити:</p></strong> <p>Отримувач: Українське бюро лінгвістичних експертиз НАН України<br/>Рахунок UA13 3209 8400 0002 6007 2103 2328 8<br/>АТ «ПроКредит Банк» м. Київ <br/>МФО 320984<br/> Код отримувача 33494653</p></div>
    }
]


class App extends React.Component {
    constructor() {
        super();
        this.state = {
            number: 0
        }
    }

    render() {
        return (
        <div className="wrapper">
            <div className="head-wrap"><h1 className="header">Українське бюро лінгвістичних експертиз</h1></div>
            <div>{DATA.map((qw, index) => <button className={this.state.number == index ? "one-font button button-clckd" : "one-font button"} key={index} onClick={() => this.setState({number: index})}>{qw.title}</button>)}</div>
            <div className="button-wrap"></div>
            <div className="main-div">
                <h2 className="one-font">{DATA[this.state.number].title}</h2>
                {DATA[this.state.number].text}
            </div>
            <div className="footer"></div>
            <div className="button-wrap"></div>
        </div>
    );  
    }
}
	
export default App;
